app/controllers/tramwajs_controller.rb

SELECT "tramwajs".* FROM "tramwajs"
---
  def index
    @tramwajs = Tramwaj.all

INSERT INTO "tramwajs" ("nazwa", "rok_produkcji", "opis", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["nazwa", "dsaf"], ["rok_produkcji", 1223], ["opis", "wesa ghd sfdgdgfh "], ["created_at", 2017-03-14 16:31:51 UTC], ["updated_at", 2017-03-14 16:31:51 UTC]]
---
  def create
    @tramwaj = Tramwaj.new(tramwaj_params)

    respond_to do |format|
      if @tramwaj.save

DELETE FROM "tramwajs" WHERE "tramwajs"."id" = ?  [["id", 1]]
---
  def destroy
    @tramwaj.destroy

SELECT  "tramwajs".* FROM "tramwajs" WHERE "tramwajs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_tramwaj
      @tramwaj = Tramwaj.find(params[:id])